// ให้เขียนโค้ดแสดงสูตรคูณตั้งแต่ แม่ 2 ถึง แม่ 12 โดยแสดงผลออกมาใน console
// 2 x 1 = 2
// 2 x 2 = 4
// ...
// หมายเหตุ : คำสั่งขึ้นบรรทัดใหม่ใน console ให้ใช้ \n

// สูตรคูณตั้งแต่ แม่ 2 ถึง แม่ 12
// สูตรคูณตั้งแต่ i = 2 ถึง i =  12

// เฉพาะแม่ 2 ท่องตั้งแต่  1 ถึง 12
// เฉพาะ i = 2 ท่อง j = 1 ถึง j = 12

// Format ในการท่อง
// 2 x 1 = 2
// 2 x 2 = 4
// i x j = i*j

// for (let i = 2; i <= 12; i++) {
//   console.log(`แม่!!!!!!!!!!!!!!!!!!!!!!!!! ${i}`);
//   for (let j = 1; j <= 12; j++) {
//     console.log(`${i} x ${j} = ${i * j}`);
//   }
// }

// 1 แม่ Print ได้แค่ 1 ครั้ง => formatString ?
// HINT :  ใครบางคนที่คอยสรุป (Global Variable) => String

// `2 x 1 = 2\n
//  2 x 2 = 4\n
//  2 x 3 = 6 \n`

// Outer : เลขแม่
for (let i = 2; i <= 3; i++) {
  let printStr = '';
  // Inner : เลขคูณ
  for (let j = 1; j <= 12; j++) {
    printStr += `${i} x ${j} = ${i * j}\n`;
  }
  console.log(printStr);
}
